{
  "projects": [
    {
      "id": "project1",
      "title": "E-Puck Path Planning with RRT",
      "subtitle": "Goal-biased Rapid Exploration in Webots",
      "skills": [
        "Webots",
        "Python",
        "Path Planning"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "Developed a path-planning solution using the Rapidly Exploring Random Tree (RRT) algorithm, integrated with a 50% goal bias to enable faster convergence towards a designated target in a constrained arena within Webots."
        },
        {
          "type": "paragraph",
          "content": "The RRT algorithm used a Supervisor–Controller communication loop. The Supervisor handled random state sampling, tree growth, and goal detection, while the Controller executed Monte Carlo propagations with randomized motor speeds."
        },

        {
        "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectRRT-Start_End.png",
              "alt": "E-Puck Simulation",
              "caption": "Webots simulation of E-Puck performing goal-biased navigation"
            },
            {
              "src": "/img/Projects/projectRRT-Replay.gif",
              "alt": "Path Root Tree Replay",
              "caption": "Path Root Tree Replay"
            }
          ],
          "widthPercentage": 50
        },

        {
          "type": "video",
          "videoType": "direct",
          "src": "/img/Projects/projectRRT-Sim_Video.webm",
          "title": "E-Puck RRT Navigation",
          "caption": "Live demonstration of the E-Puck robot navigating using RRT algorithm",
          "controls": true,
          "autoplay": false,
          "loop": false,
          "responsive": true
        },
        {
          "type": "paragraph",
          "content": "Each tree node used 5 different propagations, from which only the best non-colliding path (as determined by sensor-based detection) was added to the tree. A node was considered successful if it reached within a 0.1 radius of the goal."
        },
        {
          "type": "paragraph",
          "content": "Collision checking was achieved using distance sensors, and any propagation that resulted in threshold violations was discarded. The system ensured robust expansion of collision-free paths."
        },
        {
          "type": "paragraph",
          "content": "The project successfully demonstrated efficient goal-biased navigation in cluttered environments, with real-time control and planning synchronization between supervisor and controller modules."
        }
      ]
    },
    {
      "id": "project2",
      "title": "MEMS Electron Microscope Simulation",
      "subtitle": "Electron Beam Focusing in COMSOL",
      "skills": [
        "COMSOL Multiphysics",
        "Beam Optics",
        "MEMS Design"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "The project focuses on the development and performance analysis of a MEMS-based electron microscope designed to miniaturize traditional imaging technologies for nanoscale visualization. The system integrates a field emission source, a sharp silicon/CNT cathode, fabricated using anisotropic etching and CNT deposition techniques like electrophoretic deposition and spray coating, which achieved sharp emission tips with radii under 5 µm. Complementing the source is a MEMS Einzel lens composed of oxidized silicon electrodes, which, together with a 50 nm silicon nitride membrane exit window, enable beam shaping and transmission under high-vacuum conditions maintained by an ion-sorption micropump. Various configurations, including diode, triode, and feedback control loops, were tested, demonstrating stable beam production, regulation via gate voltages, and operational durability exceeding 21 hours with minimal cathode degradation."
        },

        {
        "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectElectronMicroscope-1.png",
              "alt": "Fabrication of sharp silicon/CNT cathode",
              "caption": "Fabrication of sharp silicon/CNT cathode"
            },
            {
              "src": "/img/Projects/projectElectronMicroscope-2.png",
              "alt": "Sharp silicon/CNT cathode used in experiments",
              "caption": "Sharp silicon/CNT cathode used in experiments"
            },
            {
              "src": "/img/Projects/projectElectronMicroscope-4.png",
              "alt": " Results of measurements in a triode configuration. ",
              "caption": " Results of measurements in a triode configuration. "
            }
          ],
          "widthPercentage": 30
        },

        {
          "type": "paragraph",
          "content": "COMSOL Multiphysics simulations were utilized to model and analyze the electrostatic behavior and beam focusing properties of the MEMS Einzel lens system. Geometric parameters, including a 10 mm vacuum chamber, 3 × 3 mm² electrode apertures, and a 15 µm initial beam radius, were carefully derived from reference designs. The simulation revealed precise electrostatic field mappings and particle trajectories, showing beam convergence and acceleration-deceleration phases across the lens structure. A fillet was incorporated at cylinder edges to minimize electrostatic fringe effects, thus preserving the beam’s core integrity. Electron trajectories showed highest density and convergence at the focal plane, confirming effective focusing by the lens. However, mild beam dispersion due to Coulombic repulsion was observed, indicative of space-charge effects becoming significant in miniaturized platforms."
        },

        {
        "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectElectronMicroscope-BeamFocusing.png",
              "alt": "Focusing action of the Electron Beam",
              "caption": "Focusing action of the Electron Beam"
            },
            {
              "src": "/img/Projects/projectElectronMicroscope-AvgParticleDensity.png",
              "alt": "Average Beam Position ",
              "caption": "Average Beam Position "
            },
            {
              "src": "/img/Projects/projectElectronMicroscope-ScatteringView.png",
              "alt": "1 RMS Scattering View",
              "caption": "1 RMS Scattering View"
            },
            {
              "src": "/img/Projects/projectElectonMicroscope-FringeFields.png",
              "alt": "Equipotential Mapping of the electrostatic Field",
              "caption": "Equipotential Mapping of the electrostatic Field"
            }

          ],
          "widthPercentage": 40
        },

        {
          "type": "paragraph",
          "content": "The miniaturization strategy behind the MEMS electron microscope revolved around integrating all core components, electron source, focusing optics, and vacuum system, onto a compact silicon-glass platform using MEMS fabrication techniques. By employing an Einzel lens system composed of micron-scale silicon electrodes, electrostatic fields could precisely focus the electron beam without the need for bulky magnetic lenses, enabling a planar and stackable architecture ideal for miniaturized devices. These electrostatic lenses shape the beam through controlled potential gradients, minimizing aberrations while maintaining a tight focal spot. To support electron propagation in such confined geometries, getter-based ion-sorption pumps were used to sustain high vacuum (10⁻⁵ mbar) by adsorbing residual gas molecules, crucial for avoiding beam scattering and cathode degradation. However, despite vacuum conditions, trace air molecules can ionize under high-energy beam exposure and oxidize the CNT cathode tip, gradually altering emission characteristics, necessitating careful vacuum sealing and long-term cathode material stability."
        },
        {
          "type": "paragraph",
          "content": "The analysis of beam quality post-focusing indicated that while the beam spot size of ~0.163 mm² at the focal point demonstrates effective lens action, some degradation in beam uniformity was noticeable. This was attributed to two main factors: beta-remittance and 1-RMS (root-mean-square) beam quality degradation. Beta-remittance refers to angular spread in emission trajectories due to the non-uniform surface potential of the CNT cathode, contributing to off-axis scattering and trajectory divergence. The 1-RMS beam quality measure, assessing spatial beam coherence, showed a slight increase in beam diameter variability beyond the focal plane, confirming low-level scattering and loss of focus precision. Despite these minor limitations, the MEMS electron microscope showcases a promising portable solution for localized high-resolution electron imaging, setting the foundation for further refinement in micro-lens shaping and emission control."
        }
      ]
    },
    {
      "id": "project3",
      "title": "Lagrangian Analysis of IC Engine",
      "subtitle": "Kinetic & Potential Energy Modeling of Engine Dynamics",
      "skills": [
        "Dynamics",
        "Lagrange's Method",
        "System Modeling"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "This project presents a comprehensive Lagrangian dynamic model of an internal combustion (IC) engine by treating the piston, connecting rod, and crankshaft as rigid bodies with interdependent motion. The main goal was to derive a set of nonlinear differential equations that govern the dynamics of each component using energy-based methods, particularly the Lagrange equations of the second kind. The formulation carefully accounts for translational and rotational kinetic energies, gravitational potential energies, and the coupling constraints imposed by the crank-slider geometry. Variables such as the crank angle, piston position, and connecting rod inclination were parametrized, and their time derivatives were systematically linked to evaluate the generalized velocities and accelerations."
        },
        {
          "type": "paragraph",
          "content": "By modeling the system in terms of generalized coordinates and identifying the associated inertial and potential energy terms, the study provides symbolic expressions for the total Lagrangian of the engine mechanism. The equations include dynamic interactions at the joints and the effects of offset geometries, masses, and moments of inertia. These expressions can then be used to simulate realistic crankshaft motion, force transmission, and load variations during the engine cycle. The model explicitly includes expressions for generalized forces due to combustion pressure and external constraints, making it applicable for control, optimization, and fault analysis in mechanical engine design."
        },
        {
          "type": "pdf-embed",
          "title": "Lagrangian Analysis of IC Engine - Full Report",
          "googleDriveLink": "https://drive.google.com/file/d/1UW96etH5CvSNWCgNhCU6dxCuT5ssx7N7/preview",
          "width": "100%",
          "height": 600,
          "allowFullscreen": true,
          "description": "Detailed report including mathematical derivations and simulation results"
        },
        {
          "type": "paragraph",
          "content": "Ultimately, this analytical approach enables a deeper understanding of the internal dynamics that govern IC engine efficiency and performance. It allows engineers to simulate behavior under various boundary conditions—such as crankshaft torques or combustion forces—while capturing effects like piston slap or connecting rod whip. This Lagrangian formulation lays the foundation for further control-oriented studies, multibody simulations, and digital twin implementations for predictive maintenance and design validation in engine development."
        },
        {
          "type": "paragraph",
          "content": "Validated the analytical results against dynamic simulation responses for stroke-specific angular velocities."
        }
      ]
    },
    {
      "id": "project4",
      "title": "Quadrotor Dynamics with Wind Gusts",
      "subtitle": "Trajectory Control Using PID and MPC",
      "skills": [
        "Control Systems",
        "MATLAB Simulink",
        "MPC",
        "PID"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "This project investigates the effectiveness of PID feedback control in managing quadrotor flight stability and trajectory tracking, particularly under the influence of environmental disturbances such as wind gusts. Given the increasing deployment of UAVs in real-world tasks, from surveillance to package delivery, the need for reliable control in unpredictable conditions is critical. The study simulated quadrotor dynamics using MATLAB and Simulink, evaluating the controller’s performance across different axes of motion. The key challenge addressed is the robustness of classical PID controllers, which, while effective in steady conditions, tend to falter under dynamic wind perturbations. The project integrates wind disturbance models into the control environment to assess the response latency, overshooting behavior, and tracking precision of the UAV."
        },
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF; font-size: 1.4em;\">System Specifications & Controller Design</b><br><b style=\"color: #FFFFFF; font-size: 1.2em;\">Quadrotor Parameters:</b><br><ul style=\"color: #FFFFFF;\"><li style=\"color: #FFFFFF;\">• Mass: 0.034 kg</li><li style=\"color: #FFFFFF;\">• Gravity: 9.81 m/s²</li><li style=\"color: #FFFFFF;\">• Arm Length: 0.032 m</li><li style=\"color: #FFFFFF;\">• Thrust Constant (kf): 0.005022</li><li style=\"color: #FFFFFF;\">• Drag Constant (km): 1.858e-5</li><li style=\"color: #FFFFFF;\">• Inertia Matrix: diag([2.3951, 2.3951, 3.2347]) × 10⁻⁵ kg·m²</li></ul><br><b style=\"color: #FFFFFF; font-size: 1.2em;\">Controller Architecture:</b><br><br><ul style=\"color: #FFFFFF;\"><li style=\"color: #FFFFFF;\">• Outer Loop (Position PID): Manages reference tracking (x, y, z).<br>• Gains (example for wind): Kp = [50, 50, 10], Ki = [10, 0, 0], Kd = [10, 100, 5]</li><li style=\"color: #FFFFFF;\">• Inner Loop (Attitude PID): Controls orientation (φ, θ, ψ).<br>• Gains: Kp = [100, 100, 10], Kd = [200, 200, 10]</li><li style=\"color: #FFFFFF;\">• Mixer (Motor Mixing Algorithm): Converts torque/thrust commands into individual motor speeds.</li><li style=\"color: #FFFFFF;\">• Wind Model: Introduced randomized gusts derived from empirical weather data with controllable amplitude.</li></ul>"
        },
        {
          "type": "image",
          "src": "/img/Projects/projectQuadrotorFeedbackControl-quadrotorplant.png",
          "alt": "Simulink Plant Model",
          "caption": "Simulink Plant Model for Quadrotor Dynamics"
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-OuterLoop.png",
              "alt": "Outer Loop PID Control Block",
              "caption": "Outer Loop PID Control Block"
            },
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-RotationalTranslationalDynamicsBlock.png",
              "alt": "Rotational and Translational Dynamics Block",
              "caption": "Rotational and Translational Dynamics Block"
            },
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-InnerLoop.png",
              "alt": "Inner Loop PID Control Block",
              "caption": "Inner Loop PID Control Block"
            },
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-MotorMixingAlgorithmBlock.png",
              "alt": "Motor Mixing Algorithm Block",
              "caption": "Motor Mixing Algorithm Block"
            }
          ],
          "widthPercentage": 45
        },
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF; font-size: 1.4em;\">Simulation Results</b><br>Simulations were performed under two scenarios: no wind and with wind gusts. Without wind, the PID controller maintained accurate trajectory tracking with minimal deviation across x, y, and z axes. The 3D trajectory plots revealed the quadrotor's path aligning closely with the reference, validating the PID’s responsiveness. Under wind disturbances, however, increased lag, overshoot, and instability were observed—especially in the lateral (x, y) motion. Z-axis (altitude) tracking remained relatively robust, likely due to higher derivative damping and less wind influence. The results highlighted how wind induces rotational and translational disturbances that classical PID fails to preemptively correct, requiring more adaptive or feedforward-based strategies."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-plots_NOWindGust.png",
              "alt": "No Wind Gust PID Response",
              "caption": "No Wind Gust: PID control response"
            },
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-plots_WindGust.png",
              "alt": "With Wind Gust PID Response",
              "caption": "With Wind Gust: PID control response"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-trajectoryplot_NOWindGust.png",
              "alt": "No Wind Gust: Path tracking response",
              "caption": "No Wind Gust: Path tracking response"
            },
            {
              "src": "/img/Projects/projectQuadrotorFeedbackControl-trajectoryplot_WindGust.png",
              "alt": "With Wind Gust: Path tracking response",
              "caption": "With Wind Gust: Path tracking response"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF; font-size: 1.4em;\">Conclusion and Future Scope</b><br>The study concludes that while PID controllers offer simplicity and sufficient performance in calm environments, their limitations under dynamic wind disturbances restrict their reliability in practical UAV operations. Enhancing controller robustness is essential for mission-critical applications. Proposed next steps include integrating feedforward control for anticipatory compensation, gain scheduling for mode-based tuning, and adaptive control to allow real-time adjustment of gains. Machine learning could also be leveraged to predict short-term environmental changes and adjust control strategies preemptively. These improvements, combined with better onboard sensing and computation, are vital for enabling quadrotors to navigate complex environments with minimal human oversight."
        }
      ]
    },
    {
      "id": "project5",
      "title": "Pouch Cell Thermal Simulation",
      "subtitle": "Thermal Modeling in Ansys Fluent",
      "skills": [
        "Ansys Fluent",
        "Thermal Modeling",
        "Electrochemical Simulation"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF !important; font-size: 1.4em;\">Scope and Involvement</b><br>This project focused on simulating thermal behavior of a 6S10P Li-ion pouch cell pack using ANSYS Fluent. The objective was to evaluate how variations in C-rate, ambient temperature, and cell thickness affect thermal stability and performance, while holding material and electrical parameters constant. Each pouch cell was modeled with dimensions 205 × 157 mm and variable thicknesses (3 mm and 5 mm), incorporating accurate thermal and electrical properties for both the cell body and tab connectors."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectPouchCell-Meshed.png",
              "alt": "No Wind Gust: Path tracking response",
              "caption": "No Wind Gust: Path tracking response"
            }
          ],
          "widthPercentage": 100
        },

        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF !important; font-size: 1.4em;\">Summary</b><br><span style=\"color: #FFFFFF !important;\">The study used a heat generation model within ANSYS Fluent to simulate thermal response in pouch cells under different charging and discharging stresses. The simulation examined key parameter variations:</span><br><ul style=\"color: #FFFFFF !important;\"><li style=\"color: #FFFFFF !important;\">• C-rate: 1C, 2C, 4C, 5C</li><li style=\"color: #FFFFFF !important;\">• Ambient temperature: -10°C, 0°C, 25°C, 45°C, 65°C, 80°C</li><li style=\"color: #FFFFFF !important;\">• Cell thickness: 3 mm, 5 mm</li></ul><br><span style=\"color: #FFFFFF !important;\">Structured tetrahedral meshes were developed for both thickness configurations to capture internal heat generation and surface cooling. Heat generation was modeled based on internal resistance and applied current, with boundary conditions including fixed ambient temperatures and convective cooling on all outer pouch surfaces.</span><br><br><b style=\"color: #FFFFFF !important; font-size: 1.2em;\">Post-processing provided visualizations and graphs for:</b><br><ul style=\"color: #FFFFFF !important;\"><li style=\"color: #FFFFFF !important;\">• Surface temperature vs. C-rate</li><li style=\"color: #FFFFFF !important;\">• Surface temperature vs. ambient temperature</li><li style=\"color: #FFFFFF !important;\">• Surface temperature vs. thickness</li><li style=\"color: #FFFFFF !important;\">• Voltage vs. time</li><li style=\"color: #FFFFFF !important;\">• Voltage vs. thickness</li><li style=\"color: #FFFFFF !important;\">• Voltage vs. surface temperature</li><li style=\"color: #FFFFFF !important;\">• Input current vs. time</li></ul><br><span style=\"color: #FFFFFF !important;\">Temperature contours and XY plots were used to analyze how pouch cells respond thermally and electrically under real-world operating conditions.</span>"
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectPouchCell-2.png",
              "alt": "Temperature contour showing internal thermal gradient during 4C discharge at 25°C ambient — hotspots are observed near current collector tabs.",
              "caption": "Electric potential distribution across the pouch cell terminals during discharge — highlighting voltage drop between the positive and negative tabs."
            },
            {
              "src": "/img/Projects/projectPouchCell-3.png",
              "alt": "Electric potential distribution across the pouch cell terminals during discharge — highlighting voltage drop between the positive and negative tabs.",
              "caption": "Electric potential distribution across the pouch cell terminals during discharge — highlighting voltage drop between the positive and negative tabs."
            },
            {
              "src": "/img/Projects/projectPouchCell-4.png",
              "alt": "Residual convergence of thermal and electrochemical source terms during 6S10P pouch cell simulation under 25°C ambient and 4C discharge. Energy residuals converge below 1e-6, confirming solution stability.",
              "caption": "Residual convergence of thermal and electrochemical source terms during 6S10P pouch cell simulation under 25°C ambient and 4C discharge. Energy residuals converge below 1e-6, confirming solution stability."
            }
          ],
          "widthPercentage": 100
        },
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF !important; font-size: 1.4em;\">Outcomes</b><br><ul style=\"color: #FFFFFF !important;\"><li style=\"color: #FFFFFF !important;\">• C-rate Impact: Higher C-rates (4C and 5C) led to significant heating, especially near the core, highlighting the risk of thermal runaway in densely packed pouch cells.</li><li style=\"color: #FFFFFF !important;\">• Ambient Temperature Effect: Pouch cells operated in ambient temperatures above 45°C showed steep internal temperature rises, underscoring the importance of thermal management in hot climates.</li><li style=\"color: #FFFFFF !important;\">• Thickness Variation: Thinner pouch cells (3 mm) demonstrated more efficient heat dissipation due to shorter thermal paths, offering performance advantages in compact, high-drain designs.</li><li style=\"color: #FFFFFF !important;\">• Voltage Decay: Accelerated voltage drop was observed at high ambient temperatures and C-rates, suggesting increased internal resistance.</li><li style=\"color: #FFFFFF !important;\">• Seven graphs were developed to map performance trends across all parameter variations.</li><li style=\"color: #FFFFFF !important;\">• A comprehensive report was compiled to serve as a reference for optimizing thermal designs in Li-ion pouch cell configurations for EV and energy storage applications.</li></ul>"
        },
        {
          "type": "paragraph",
          "content": "Additional cooling strategies were tested including forced air circulation and direct immersion cooling for multi-cell battery pack designs. These methods demonstrated significant improvements in thermal management, especially for high-drain applications in electric vehicles."
        }
      ]
    },
    {
      "id": "project6",
      "title": "Ordnance Factory Medak| Ministry of Defence| Govt of Indias",
      "subtitle": "FEA for Load Distribution in Race Chassis",
      "skills": [
        "FEA",
        "Mechanical Design",
        "SolidWorks Simulation"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF !important; font-size: 1.4em;\">Scope and Involvement</b><br>During my Internship at OFMK, I engaged in the manufacturing and assembly of Infantry Combat Vehicles (ICVs) like the BMP-II Sarath and its variants. Study of the processes of hull and turret fabrication, powerpack assembly, suspension system alignment, and functional testing."
        },
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF !important; font-size: 1.4em;\">Summary</b><br><span style=\"color: #FFFFFF !important;\">Spent a month and a half as an in-plant intern for Ordnance Factory Medak, Documenting the various processes and sequences involved in the fabrication and quality testing of Armored Infantry Combat Vehicles. The Armored vehicles included Mine protected vehicles and Amphibious BMP tanks. "
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectOFMK-FICV.png",
              "alt": "Futuristic Infantry Combat Vehicle(FICV)",
              "caption": "Futuristic Infantry Combat Vehicle(FICV)"
            },
            {
              "src": "/img/Projects/projectOFMK-MPV.png",
              "alt": "Mine Protrected Vehicle (MPV)",
              "caption": "Mine Protrected Vehicle (MPV)"
            },
            {
              "src": "/img/Projects/projectOFMK-WaldrichCoberg.png",
              "alt": "Waldrich Coberg CNC Machine",
              "caption": "Waldrich Coberg CNC Machine"
            }
          ],
          "widthPercentage": 30
        },

       {
          "type": "image-row",
          "images": [
            {
          "src": "/img/Projects/projectOFMK-PKT120mm.png",
          "alt": "PKT 120mm Cannon",
          "caption": "30mm 2A42 PKT automatic cannon with integrated mounting system"
            }
          ],
          "widthPercentage": 60,
          "alignment": "center"
        },
        
        {
          "type": "paragraph",
          "content": "During my internship at OFMK, I was closely involved in the fabrication and assembly processes for the BMP-II Sarath Infantry Combat Vehicle. I worked alongside teams handling CNC machining operations for critical components like the hull and turret, using both vertical and horizontal machining centers. The hull segments, typically made from 8–15 mm thick armored steel (Jackal grade), were welded using MIG and Arc welding techniques. I also observed the use of TIG welding with argon shielding for lighter aluminum parts like exhaust covers and bonnet assemblies. These weldments were subjected to heat treatment around 250–280°C to relieve internal stresses and improve structural performance."
        },
        {
          "type": "paragraph",
          "content": "As part of the vehicle assembly process, I assisted in tasks ranging from installing torsion bar suspension systems to aligning the powerpack, a 300 HP UTD-20, 6-cylinder diesel engine coupled to a 5-speed planetary gearbox. We followed a standard sequence including suspension fitting, cabling, mounting of auxiliary components like the ejector and bilge pumps, and preliminary quality checks. I participated in leak testing using pneumatic tools and soapy water inspection and observed how post-assembly tests such as dipping and sprinkling ensured amphibious sealing. Critical dimensional verification of the hull using Coordinate Measuring Machines (CMM) was also part of the workflow."
        },

        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Projects/projectOFMK-LineUp.jpg",
              "alt": "Line Up of Infantry Combat Vehicle(FICV)",
              "caption": "Line Up of Infantry Combat Vehicle(FICV)"
            },
            {
              "src": "/img/Projects/projectOFMK-InvestmentCasting.jpeg",
              "alt": "Investment Casting Process-Zircon Spray Coating on Wax Pattern",
              "caption": "Investment Casting Process-Zircon Spray Coating on Wax Pattern"
            },
            {
              "src": "/img/Projects/projectOFMK-CastingPour.jpeg",
              "alt": "Casting Pouring Process",
              "caption": "Casting Pouring Process"
            }
          ],
          "widthPercentage": 30
        },

        {
          "type": "paragraph",
          "content": "Toward the latter half of the internship, I worked on turret integration which included the installation of the 30 mm 2A42 PKT automatic cannon with a fire rate of 300rpm. I supported tasks related to its mechanical alignment, elevation gearing, and mounting of optical systems. The turret assembly was also fitted with the NBC (Nuclear Biological & Chemical) protection system, onboard fire suppression lines, and compressed air-based engine starters. Before delivery, I got to observe full stationary testing procedures, such as engine preheat using glow plug chambers for high altitude operations, compressor cycling, and radiator airflow validation using ejector principles. This hands-on exposure gave me valuable insights into the integration of heavy mechanical, thermal, and control subsystems within an armored vehicle."
        },
        {
          "type": "paragraph",
          "content": "<b style=\"color: #FFFFFF !important; font-size: 1.4em;\">Outcomes:</b><br><span style=\"color: #FFFFFF !important;\">- Designed a Hydraulic latch for the rear door assembly for easy egress and ingress of troops.<br> - Developed a detailed technical report to aid future intern training."
        },
        {
          "type": "paragraph",
          "content": "Included images from simulation results, indicating stress concentrations around PKT gun mounts and 5-axis machining regions."
        }
      ]
    },
    {
      "id": "project7",
      "title": "Lotus Shark Steering Wheel Mechanism Analysis",
      "subtitle": "Kinematic Linkage and Ackermann Behavior",
      "skills": [
        "Kinematic Modeling",
        "Mechanical Simulation",
        "Design Evaluation"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "Analyzed the steering geometry and kinematic behavior of the Lotus Shark car across road, race, and off-road conditions."
        },
        {
          "type": "paragraph",
          "content": "Studied linkage deformation under bump, steer, and cornering scenarios using animated simulation GIFs."
        },
        {
          "type": "image",
          "src": "/img/Projects/projectLotusShark-lotus_shark1.png",
          "alt": "Lotus Shark Steering Layout",
          "caption": "Initial geometry setup of the steering assembly"
        },
        {
          "type": "image",
          "src": "img/Projects/projectLotusShark-Road_Car_Bump.gif",
          "alt": "Front View Simulation",
          "caption": "Steering kinematics viewed from the front"
        },
        {
          "type": "image",
          "src": "img/Projects/projectLotusShark-Road_Car_Steer.gif",
          "alt": "Top View",
          "caption": "Top view of steering movement"
        },
        {
          "type": "image",
          "src": "img/Projects/project6-steering3.gif",
          "alt": "Tie Rod Response",
          "caption": "Linkage deformation during cornering"
        },
        {
          "type": "image",
          "src": "img/Projects/project6-steering4.gif",
          "alt": "Assembly Overview",
          "caption": "Complete motion overview of the steering"
        },
        {
          "type": "paragraph",
          "content": "Evaluated Ackermann angle fidelity, scrub radius changes, and toe variations in road car configurations."
        },
        {
          "type": "paragraph",
          "content": "Race car simulations focused on minimizing bump steer and camber change while preserving responsive feedback."
        },
        {
          "type": "paragraph",
          "content": "Off-road configuration emphasized maximum articulation and roll compliance with reinforced tie rod mechanics."
        },
        {
          "type": "paragraph",
          "content": "Final comparison showcased trade-offs between turning radius, response delay, and mechanical wear across configurations."
        }
      ]
    },
    {
      "id": "project8",
      "title": "Tubular Chassis Stress Analysis",
      "subtitle": "FEA for Load Distribution in Race Chassis",
      "skills": [
        "FEA",
        "Mechanical Design",
        "SolidWorks Simulation"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "Simulated a Baja SAE tubular chassis subjected to off-road terrain loads using SolidWorks Simulation."
        },
        {
          "type": "paragraph",
          "content": "Modeling included cornering, jumping, and landing load cases with material properties based on AISI 4130 chromoly steel."
        },
        {
          "type": "image",
          "src": "/img/Projects/project7-chassis.png",
          "alt": "Tubular Chassis FEA",
          "caption": "Stress plot showing torsional deformation under load"
        },
        {
          "type": "paragraph",
          "content": "Determined maximum torsional stresses and bending moments in roll cage, A-arms, and rear suspension mounts."
        },
        {
          "type": "paragraph",
          "content": "Assessed design changes for weight reduction while meeting Factor of Safety > 2 across all critical joints."
        }
      ]
    }
  ]
}
