{
  "projects": [
    {
      "id": "research_paper1",
      "title": "Research Paper: Study of Hierarchical Auxetic Materials",
      "subtitle": "B.E. Capstone Project in Collaboration with DRDO-DYSL, Osmania University, 2021",
      "skills": ["Finite Element Analysis", "SolidWorks", "Fusion 360", "Material Science"],
      "description": [
        {
          "type": "paragraph",
          "content": "This study, conducted in collaboration with the Defence Research and Development Organisation – Young Scientist Laboratory for Cognitive Technologies (DRDO-DYSL CT), Hyderabad, investigates the design, simulation, and mechanical evaluation of hierarchically architectured materials, with a specific focus on auxetic structures. Auxetics are materials that exhibit a negative Poisson’s ratio, meaning they expand laterally when stretched longitudinally—a counterintuitive behavior enabled by their internal geometry. The project aimed to understand and compare the performance of re-entrant auxetic honeycomb structures against conventional hexagonal honeycomb structures under various loading conditions."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/Auxetic DRDO/Unit_Honeycomb_Cell.png",
              "alt": "Honeycomb Unit Cell CAD Design",
              "caption": "Honeycomb Unit Cell CAD Design"
            },
            {
              "src": "/img/Research/Auxetic DRDO/Unit_Reentrant_Cell.png",
              "alt": "Reentrant Unit Cell CAD Design",
              "caption": "Reentrant Unit Cell CAD Design"
            },
            {
              "src": "/img/Research/Auxetic DRDO/Unit_Cell_Design.png",
              "alt": "Reentrant & Honeycomb Unit Cell Design calculations",
              "caption": "Reentrant & Honeycomb Unit Cell Design calculations"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "Using CAD modeling in Fusion 360 and finite element simulation in COMSOL Multiphysics, both honeycomb geometries were analyzed for their response to uniaxial and impact loading in orthogonal directions. Parameters such as Young’s modulus, strain energy, Poisson’s ratio, and equivalent strain were computed and compared between the two geometries. The re-entrant (auxetic) structures consistently demonstrated higher energy absorption, better impact resistance, and synclastic curvature under bending, thereby validating their advantage over conventional honeycombs for dynamic and deformation-sensitive applications."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/Auxetic DRDO/Honeycomb_2Darray.png",
              "alt": "2D Array of Honeycomb Unit Cells",
              "caption": "2D Array of Honeycomb Unit Cells"
            },
            {
              "src": "/img/Research/Auxetic DRDO/Reentrant_2Darray.png",
              "alt": "2D Array of Reentrant Unit Cells",
              "caption": "2D Array of Reentrant Unit Cells"
            },
            {
              "src": "/img/Research/Auxetic DRDO/Stacked_Array.png",
              "alt": "2D Array of Stacked Reentrant Unit Cells",
              "caption": "2D Array of Stacked Reentrant Unit Cells"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/Auxetic DRDO/Honeycomb_Deformation.png",
              "alt": "FEA simulation of hexagonal structure under axial impact load showing stress distribution.",
              "caption": "FEA simulation of hexagonal structure under axial impact load showing stress distribution."
            },
            {
              "src": "/img/Research/Auxetic DRDO/Honeycomb-Squashed.png",
              "alt": " Deformation profile of hexagonal structure under dynamic impact conditions.",
              "caption": "Deformation profile of hexagonal structure under dynamic impact conditions."
            },
            {
              "src": "/img/Research/Auxetic DRDO/Reentrant_Deformation.png",
              "alt": "FEA simulation of re-entrant structure under axial impact load illustrating localized stress zones.",
              "caption": "FEA simulation of re-entrant structure under axial impact load illustrating localized stress zones."
            },
            {
              "src": "/img/Research/Auxetic DRDO/Reentrant-Squashed.png",
              "alt": "Deformation profile of re-entrant structure demonstrating higher energy absorption during impact.",
              "caption": "Deformation profile of re-entrant structure demonstrating higher energy absorption during impact."
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "Manufacturing feasibility was also explored, with additive manufacturing techniques like Fused Deposition Modeling (FDM), Electron Beam Melting (EBM), and Selective Laser Sintering (SLS) identified as suitable processes for fabricating complex auxetic geometries. These methods enable the practical realization of multi-scale hierarchical structures that cannot be produced via traditional manufacturing. Notably, the influence of anisotropic print properties and build orientation on final mechanical behavior was considered as an important factor in design validation."
        },
        {
          "type": "paragraph",
          "content": "The results of this project reinforce the potential of hierarchically architectured auxetic materials in applications ranging from biomedical implants and sports gear to aerospace structures and blast-resistant components. The strong correlation between analytical models and simulation results not only validates the accuracy of unit-cell based design approaches but also opens pathways for future research in functionally graded auxetic composites and multi-material lattices. This work represents a foundational step toward tailoring material behavior through architectural design, backed by a collaborative research framework with DRDO for defense-oriented innovations."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/Auxetic DRDO/Bilateral_Strain.png",
              "alt": "Bilateral strain analysis of auxetic structures.",
              "caption": "Bilateral strain analysis of auxetic structures."
            },
            {
              "src": "/img/Research/Auxetic DRDO/BioMed_Application.png",
              "alt": "BioMed Application",
              "caption": "BioMed Application"
            },
            {
              "src": "/img/Research/Auxetic DRDO/Auxetic_KneeCap.png",
              "alt": "Auxetic Knee Cap",
              "caption": "Auxetic Knee Cap"
            }
          ],
          "widthPercentage": 48
        }
      ]
    },
    {
      "id": "research_paper2",
      "title": "Convolutional Neural Network for Vehicle Detection",
      "subtitle": "YOLOv2-based Object Classification for Autonomous Driving",
      "skills": [
        "Deep Learning",
        "TensorFlow",
        "Python",
        "Object Detection"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "Developed a real-time object detection pipeline using YOLOv2 for identifying vehicles in dashcam footage. A custom dataset was created by annotating front-view road images with bounding boxes for cars, trucks, and buses. These were resized to 608x608 to match the input dimensions for YOLOv2."
        },
        {
          "type": "paragraph",
          "content": "Trained the network with TensorFlow using 5 anchor boxes per grid cell. The output tensors (19x19x5x85) were filtered with IoU-based NMS to refine predictions. Detection was robust in various driving conditions."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/researchCNN-DefnofBox.jpg",
              "alt": "YOLO vehicle detection",
              "caption": "Detected vehicles with class probabilities visualized as bounding boxes"
            },
            {
              "src": "/img/Research/researchCNN-Cell19X19.png",
              "alt": "YOLO Network Architecture",
              "caption": "YOLOv2 CNN model layout showing multi-scale grid encoding and anchor boxes"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "The model produced consistent results across 8 test frames, with bounding box placement matching ground truth. Detection confidence remained above 85% in non-occluded conditions."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/researchCNN-YOLO-road.png",
              "alt": "YOLO vehicle detection",
              "caption": "Detected vehicles with class probabilities visualized as bounding boxes"
            },
            {
              "src": "/img/Research/researchCNN-CelloverlayonPic.png",
              "alt": "YOLO Network Architecture",
              "caption": "YOLOv2 CNN model layout showing multi-scale grid encoding and anchor boxes"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "YOLOv2 functions like `filter_boxes`, `iou`, and `non_max_suppression` were used to post-process detections. Tensor outputs were decoded and drawn on original video frames. The pipeline was modularized for future integration into ADAS stacks."
        },
        {
          "type": "image",
          "src": "/img/Research/researchCNN-Non-Max_Suppression.png",
          "alt": "YOLO Grid Cell Encoding",
          "caption": "Each grid cell predicts 5 bounding boxes and associated object class scores"
        },
        {
          "type": "paragraph",
          "content": "Final results show reliable detection of multiple vehicles in real-time with high confidence, forming a baseline for perception layers in autonomous driving systems."
        },
        {
          "type": "image",
          "src": "/img/Research/researchCNN-FinalPredictionModel.png",
          "alt": "YOLO Grid Cell Encoding",
          "caption": "Each grid cell predicts 5 bounding boxes and associated object class scores"
        }
      ]
    },
    {
      "id": "research_paper3",
      "title": "Fire Fighting Robot",
      "subtitle": "Autonomous Flame Detection and Suppression Robot",
      "skills": [
        "Autonomous Navigation",
        "Sensor Integration",
        "Embedded Systems",
        "Fire Detection"
      ],
      "description": [
        {
          "type": "paragraph",
          "content": "This paper presents the design and development of a compact, mobile firefighting robot named QRob, aimed at reducing human exposure to hazardous fire environments. Designed for narrow and constrained spaces such as tunnels, basements, and high-rise buildings, QRob integrates ultrasonic and flame sensors to autonomously detect obstacles and fire sources, respectively. The robot halts at a safe distance of 40 cm from the detected fire and allows remote fire suppression via an onboard water pump, controlled through a wireless transmitter."
        },
        {
          "type": "paragraph",
          "content": "QRob is built using an acrylic chassis for heat resistance and structural stability, and it features a real-time video feed through a camera linked to a smartphone, enhancing situational awareness for remote operators. The system architecture comprises an Arduino Uno microcontroller, motor drivers, DC motors, a water pump, and various sensors. QRob’s autonomous detection capability combined with human-in-the-loop control ensures operational flexibility in fire rescue scenarios."
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/researchFRED-2.png",
              "alt": "YOLO vehicle detection",
              "caption": "Detected vehicles with class probabilities visualized as bounding boxes"
            },
            {
              "src": "/img/Research/researchFRED-FlowChart1.png",
              "alt": "YOLO Network Architecture",
              "caption": "YOLOv2 CNN model layout showing multi-scale grid encoding and anchor boxes"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "Emphasis is placed on cost-efficiency, portability, and quick deployment, making QRob especially useful for fire departments in urban environments. The robot's obstacle-avoidance capability, combined with onboard thermal and visual sensing, supports navigation in cluttered and dangerous conditions. The project also compares QRob with other firefighting robotic platforms such as Thermite and Hoya, highlighting its unique advantages in size, modularity, and control integration."
        },
        {
          "type": "image",
          "src": "/img/Research/researchFRED-FlowChart3.png",
          "alt": "YOLO Grid Cell Encoding",
          "caption": "Each grid cell predicts 5 bounding boxes and associated object class scores"
        },
        {
          "type": "image-row",
          "images": [
            {
              "src": "/img/Research/researchFRED-FlowChart2.png",
              "alt": "YOLO vehicle detection",
              "caption": "Detected vehicles with class probabilities visualized as bounding boxes"
            },
            {
              "src": "/img/Research/researchFRED-FlowChart4.png",
              "alt": "YOLO Network Architecture",
              "caption": "YOLOv2 CNN model layout showing multi-scale grid encoding and anchor boxes"
            }
          ],
          "widthPercentage": 48
        },
        {
          "type": "paragraph",
          "content": "Overall, this study demonstrates how a hybrid autonomous-teleoperated robotic system can enhance fire suppression efforts by reducing risks to firefighters while providing real-time thermal and visual intelligence from the fireground."
        }
      ]
    }
  ]
}
